# Data Science and Visualization (RUC F2023)

## Lecture 2: Exploratory Data Analysis (EDA)

# Exercise 3:

Fortunate500 dataset: write your code in a JupyterNotebook
1. Get the maximum revenue value for each year (tip: using groupby).
2. Find the 10 companies that appear in Fortunate 500 least frequently.
3. Fill in the missing profit values using the minimum profit value of the corresponding year. (remember to convert the profit type to float64)

In [1]:
import os
import numpy as np 
import pandas as pd

os.chdir('C:/Data')
data = pd.read_csv('fortune500.csv')

In [2]:
data.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

Since some of the column names are not concise enough and their inline blanks may cause problems for operations later, let's change them.

In [3]:
data.columns = ['year', 'rank', 'company', 'revenue', 'profit']
data.columns

Index(['year', 'rank', 'company', 'revenue', 'profit'], dtype='object')

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25500 entries, 0 to 25499
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   year     25500 non-null  int64
 1   rank     25500 non-null  int64
 2   company  25500 non-null  object
 3   revenue  25500 non-null  float64
 4   profit   25500 non-null  object
dtypes: float64(1), int64(2), object(2)
memory usage: 996.2+ KB

### 1. Get the maximum revenue value for each year.

In [10]:
max_rev_year = data.groupby('year')['revenue'].max()
max_rev_year

year
1955      9823.5
1956     12443.3
1957     10796.4
1958     10989.8
1959      9522.0
1960     11233.1
1961     12736.0
1962     11395.9
1963     14640.2
1964     16494.8
1965     16997.0
1966     20734.0
1967     20208.5
1968     20026.3
1969     22755.4
1970     24295.1
1971     18752.4
1972     28263.9
1973     30435.2
1974     35798.3
1975     42061.3
1976     44864.8
1977     48630.8
1978     54961.3
1979     63221.1
1980     79106.5
1981    103142.8
1982    108107.7
1983     97172.5
1984     88561.1
1985     90854.0
1986     96371.7
1987    102813.7
1988    101782.0
1989    121085.0
1990    126974.3
1991    125126.0
1992    123780.1
1993    132774.9
1994    133621.9
1995    154951.2
1996    168828.6
1997    168369.0
1998    178174.0
1999    161315.0
2000    189058.0
2001    210392.0
2002    219812.0
2003    246525.0
2004    258681.0
2005    288189.0
Name: revenue, dtype: float64

### 2. Find the 10 companies that appear in Fortunate 500 least frequently.

In [62]:
# We get each company's total count cross all years
frequents = data.groupby('company')['year'].count()

# We obtain all those companies with count equal to 1
least_frequents = frequents[frequents == 1]

# We print the first 10 which are in alphabetical order due to 'groupby' on company
least_frequents.head(10)

company
ACX Technologies             1
ADC Telecommunications       1
AMBAC Industries             1
ATCOR                        1
AXA Financial                1
Adelphia Communications      1
Allen Group                  1
Amalgamated Sugar            1
American Chicle              1
American Medical Holdings    1
Name: year, dtype: int64

Alternatively we can do the following. Note the two lists are different, since there are many companies that entered in the list only once.

In [63]:
frequents = data.company.value_counts()
least_frequents = frequents[frequents == 1]

# We need to sort on the index to get the company names in alphabetical order
least_frequents.sort_index().head(10)

ACX Technologies             1
ADC Telecommunications       1
AMBAC Industries             1
ATCOR                        1
AXA Financial                1
Adelphia Communications      1
Allen Group                  1
Amalgamated Sugar            1
American Chicle              1
American Medical Holdings    1
Name: company, dtype: int64

Note that the following also returns the 10 least frequent ones but the company names are not sorted and so the result is different.

In [64]:
data.company.value_counts().nsmallest(10).sort_index()

American Chicle              1
Danly Machine Specialties    1
Flour Mills of America       1
Grolier Society              1
Idacorp                      1
Pennzoil-Quaker State        1
Standard Motor Products      1
Summit Bancorp               1
Truax-Traer Coal             1
Zurn Industries              1
Name: company, dtype: int64

### 3. Fill in the missing profit values using the minimum profit value of the corresponding year.

#### 1. We replace 'N-A.' strings by np.nan

In [65]:
data.loc[data["profit"] == "N.A.", "profit"] = np.nan

#### 2. We convert the profit type to float64

In [67]:
data.profit = data.profit.astype('float64')
data['profit'].describe()

count    25131.000000
mean       207.903677
std       1173.695947
min     -98696.000000
25%          8.900000
50%         35.500000
75%        150.500000
max      25330.000000
Name: profit, dtype: float64

#### 3. We fill in with the minimum profit each year using groupby + transform

In [68]:
data['profit'].fillna(data.groupby('year')['profit'].transform('min'), inplace=True)
data['profit'].describe()

count    25500.000000
mean       134.445039
std       2061.561380
min     -98696.000000
25%          8.200000
50%         34.200000
75%        147.100000
max      25330.000000
Name: profit, dtype: float64

Notice the statistics are different from those before the filling.